Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs-examples</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["js-ipfs-examples:SgtPooki"] will be destroyed
  # (because key ["js-ipfs-examples:SgtPooki"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "js-ipfs-examples:SgtPooki" -> null
      - permission = "admin" -> null
      - repository = "js-ipfs-examples" -> null
      - username   = "SgtPooki" -> null
    }

  # github_repository_collaborator.this["js-ipfs-examples:sgtpooki"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "js-ipfs-examples"
      + username                    = "SgtPooki"
    }

  # github_repository_file.this["github-mgmt/CODEOWNERS"] will be destroyed
  # (because key ["github-mgmt/CODEOWNERS"] is not in for_each map)
  - resource "github_repository_file" "this" {
      - branch              = "master" -> null
      - commit_author       = "GitHub" -> null
      - commit_email        = "noreply@github.com" -> null
      - commit_message      = "chore: Update CODEOWNERS [skip ci]" -> null
      - commit_sha          = "94eb544d6ef3b9721457b16bceb4d434331e33db" -> null
      - content             = <<-EOT
            # The ipdx team is responsible for GitHub Management maintenance
            * @ipfs-examples/ipdx
            # The github-mgmt stewards team is responsible for triaging/reviewing configuration change requests
            # The ipdx team is added here temporarily to witness use patterns in github-mgmt
            /github/ipfs-examples.yml @ipfs-examples/github-mgmt-stewards @ipfs-examples/ipdx
        EOT -> null
      - file                = "CODEOWNERS" -> null
      - id                  = "github-mgmt/CODEOWNERS" -> null
      - overwrite_on_create = false -> null
      - repository          = "github-mgmt" -> null
      - sha                 = "f328a9cb44d479b93dc771a2c4ebee6cab6dfedc" -> null
    }

  # github_repository_file.this["github-mgmt/codeowners"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update CODEOWNERS [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # The ipdx team is responsible for GitHub Management maintenance
            * @ipfs-examples/ipdx
            # The github-mgmt stewards team is responsible for triaging/reviewing configuration change requests
            # The ipdx team is added here temporarily to witness use patterns in github-mgmt
            /github/ipfs-examples.yml @ipfs-examples/github-mgmt-stewards @ipfs-examples/ipdx
        EOT
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "github-mgmt"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->